Repository: clemetayer/RocketJumpThing
Catalog: Translations/po/*.po
Languages: french

# MOVEMENT_FORWARD
source: Forward
french: Avant

# MOVEMENT_BACKWARD
source: Backward
french: Arrière

# MOVEMENT_LEFT
source: Left
french: Gauche

# MOVEMENT_RIGHT
source: Right
french: Droite

# MOVEMENT_JUMP
source: Jump
french: Saut

# MOVEMENT_SLIDE
source: Slide
french: Glisser

# ACTION_SHOOT
source: Shoot
french: Tirer

# RESTART_LAST_CP
source: Respawn to checkpoint
french: Retour au checkpoint

source: Left click
french: Clic gauche

source: Right click
french: Clic droit

# MIDDLE_CLICK
source: Mouse wheel click
french: Clic molette

# SPECIAL_1
source: Mouse special 1
french: Souris spécial 1

# SPECIAL_2
source: Mouse special 2
french: Souris spécial 2

# WHEEL_UP
source: Mouse wheel up
french: Souris molette haut

# WHEEL_DOWN
source: Mouse wheel down
french: Souris molette bas

# WHEEL_RIGHT
source: Mouse wheel right
french: Souris molette droite

# WHEEL_LEFT
source: Mouse wheel left
french: Souris molette gauche

source: Left click (mask)
french: Clic gauche (masque)

source: Right click (mask)
french: Clic droit (masque)

# MIDDLE_CLICK_MASK
source: Mouse wheel click (mask)
french: Clic molette (masque)

# SPECIAL_1_MASK
source: Mouse special 1 (mask)
french: Souris spécial 1 (masque)

# SPECIAL_2_MASK
source: Mouse special 2 (mask)
french: Souris spécial 2 (masque)

source: Main menu
french: Menu principal

# MENU_QUIT
source: Quit
french: Quitter

# MENU_SETTINGS
source: Settings
french: Options

# MENU_RESTART
source: Restart
french: Recommencer

# MENU_RETURN
source: Return
french: Retour

# MENU_PLAY
source: Play
french: Jouer

# MENU_LEVEL_SELECTION
source: Level selection
french: Sélection de niveau

# MENU_NEXT_LEVEL
source: Next level
french: Niveau suivant

# MENU_RESUME
source: Resume
french: Continuer

# MENU_SETTINGS_TAB_GENERAL
source: General
french: Général

# MENU_SETTINGS_TAB_CONTROLS
source: Controls
french: Contrôles

# MENU_SETTINGS_TAB_AUDIO
source: Audio
french: Son

# MENU_SETTINGS_TAB_VIDEO
source: Video
french: Vidéo

# MENU_SETTINGS_CHANGE_KEY_POPUP
source: Press a key for action %s :
french: Appuyez sur une touche pour l'action %s :

# MENU_SETTINGS_ADD_CFG_POPUP_TITLE
source: Enter a name
french: Entrez un nom

# MENU_SETTINGS_ADD_CFG_POPUP_LABEL
source: Enter a preset name :
french: Entrez un nom de preset :

# MENU_SETTINGS_SAVE_CFG_POPUP_TITLE
source: Please confirm...
french: Veuillez confirmer...

# MENU_SETTINGS_SAVE_CFG_POPUP_LABEL
source: Do you want to overwrite %s ?
french: Voulez-vous écraser %s ?

# SETTINGS_GENERAL_LANGUAGE_CATEGORY
source: Language
french: Langue

# SETTINGS_GENERAL_LANGUAGE_OPTION
source: Language :
french: Langue :

# SETTINGS_CONTROLS_MOVEMENT_CATEGORY
source: Movement
french: Mouvement

# SETTINGS_CONTROLS_UI_CATEGORY
source: UI
french: IU

# SETTINGS_AUDIO_MAIN_CATEGORY
source: Main
french: Principal

# SETTINGS_AUDIO_MAIN_LABEL
source: Main :
french: Principal :

# SETTINGS_AUDIO_BGM_CATEGORY
source: BGM
french: Musique

# SETTINGS_AUDIO_BGM_LABEL
source: BGM :
french: Musique :

# SETTINGS_AUDIO_EFFECTS_CATEGORY
source: Effects
french: Effets

# SETTINGS_AUDIO_EFFECTS_LABEL
source: Effects :
french: Effets :

# SETTINGS_VIDEO_DISPLAY_CATEGORY
source: Display
french: Affichage

# SETTINGS_VIDEO_DISPLAY_MODE
source: Display mode :
french: Mode :

# SETTINGS_VIDEO_FULL_SCREEN
source: Full screen
french: Plein écran

# SETTINGS_VIDEO_WINDOWED
source: Windowed
french: Fenêtré

# PLAYER_MESSAGE_SECURITY_STATUS
source: Security level :
french: Niveau de sécurité :

# PLAYER_MESSAGE_SECURITY_DISABLED
source: Security disabled
french: Sécurité désactivée

# PLAYER_MESSAGE_ACCESS_TO_ANOMALY_GRANTED
source: Portail open
french: Ouverture du portail

# TUTORIAL_MOVE
source: ##movement_wasd## to move around.
french: ##movement_wasd## pour se déplacer.

# TUTORIAL_JUMP
source: ##movement_jump## to jump.
french: ##movement_jump## pour sauter.

# TUTORIAL_BHOP
source: Keep ##movement_jump## pressed to accelerate.
french: Garder ##movement_jump## appuyé pour accélerer.

# TUTORIAL_STRAFE
source: To accelerate even more: ##movement_jump## + ##movement_wa## + ##mouse_strafe_left## ou ##movement_jump## + ##movement_wd## + ##mouse_strafe_right##.
french: pour accélerer encore plus : ##movement_wa## + ##mouse_strafe_left## ou ##movement_wd## + ##mouse_strafe_right##.

# TUTORIAL_AIR_CONTROL
source: ##movement_w## + ##mouse_strafe_left_right## in the air to control your direction.
french: ##movement_w## + ##mouse_strafe_left_right## en l'air pour controler sa direction.

# TUTORIAL_CHECKPOINT
source: ##restart_last_cp## to respawn at the checkpoin. ##restart## to restart.
french: ##restart_last_cp## pour réapparaitre au checkpoint. ##restart## pour recommencer.

# TUTORIAL_SLIDE_1
source: ##movement_slide## to slide.
french: ##movement_slide## pour glisser.

# TUTORIAL_SLIDE_2
source: ##movement_jump## during a slide to slide jump.
french: ##movement_jump## pendant une glissade pour faire un saut accéléré.

# TUTORIAL_WALL_RIDE
source: ##movement_slide## to wallride ##movement_jump## while wallriding to jump.
french: ##movement_slide## pour wallride ##movement_jump## en wallride pour sauter.

# TUTORIAL_ROCKETS
source: ##shoot## to ##rocket_icon##.
french: ##shoot## pour ##rocket_icon##.

# TUTORIAL_ROCKET_JUMP
source: ##movement_jump## + ##rocket_icon## at your feet to ##rocket_jump_icon##.
french: ##rocket_icon## aux pieds pour ##rocket_jump_icon##.

# TUTORIAL_ROCKET_WALL_JUMP
source: ##rocket_jump_icon## on the wall to climb.
french: ##rocket_jump_icon## sur le mur pour escalader.

# TUTORIAL_ROCKET_PADS
source: ##rocket_icon## on ##boost_pad## to temporarily increase the launch power.
french: ##rocket_icon## + ##boost_pad## pour plus de puissance.

# END_GAME_SIMULATION_COMPLETED
source: Simulation ended
french: Simulation terminée

# END_GAME_TEST_X_PASSED
source: Test %d - [color=#00ff00]PASSED[/color] - [color=#00ffff]%s[/color]
french: Test %d - [color=#00ff00]RÉUSSI[/color] - [color=#00ffff]%s[/color]

# END_GAME_TOTAL_TIME_SEPARATOR
source: --------- RESULTS ---------
french: -------- RESULTATS --------

# END_GAME_TESTS_RESULTS
source: [color=#00ff00]ALL PASSED[/color] - [color=#00ffff]%s[/color]
french: [color=#00ff00]TOUS RÉUSSIS[/color] - [color=#00ffff]%s[/color]

# END_GAME_APPRECIATION_HOW
source: [shake rate=30 level=10]... How is this possible ?[/shake]
french: [shake rate=30 level=10]... Comment est-ce possible ?[/shake]

# END_GAME_APPRECIATION_AMAZING
source: [wave amp=50 freq=2]Amazing ![/wave]
french: [wave amp=50 freq=2]Incroyable ![/wave]

# END_GAME_APPRECIATION_WELL_DONE
source: Well done !
french: Bien joué !

# END_GAME_APPRECIATION_NOT_BAD
source: Not bad !
french: Pas mal !

# END_GAME_EXIT
source: You can quit by pressing escape
french: Vous pouvez quitter en appuyant sur echap

# END_GAME_CREDITS_LOADING
source: Loading credits
french: Chargement des crédits

# END_GAME_GAME_MADE_BY
source: A game made by clemetayer
french: Un jeu fait par clemetayer

# END_GAME_WITH_GODOT
source: With the Godot engine
french: Avec le moteur de jeu Godot

# END_GAME_WITH_LMMS
source: Sounds and music made with LMMS
french: Sons et musiques réalisés avec LMMS

# END_GAME_WITH_QODOT_TB
source: Levels made with Trenchbroom and Qodot
french: Niveaux réalisés avec Trenchbroom et Qodot

# END_GAME_WITH_MATERIAL_MAKER
source: Textures made with MaterialMaker
french: Textures réalisées avec MaterialMaker

# END_GAME_WITH_SPACESCAPE
source: Skyboxes made with Spacescape
french: Skyboxes réalisées avec Spacescape

# END_GAME_WITH_KENNEY
source: Icons and particles by Kenney : https://kenney.nl/
french: Icônes et particules par Kenney : https://kenney.nl/

# END_GAME_FONTS
source: Fonts : Oswald, CourierPrimeCode
french: Polices : Oswald, CourierPrimeCode

# END_GAME_OTHER_TOOLS
source: Other tools used : GDUnit3 by NullPointer, Godot-Stuff Logger by paulhocker, DebugDraw by DmitriySalnikov, Simple Skybox by Chaosus.
french: Autres outils utilisés : GDUnit3 par NullPointer, Godot-Stuff Logger par paulhocker, DebugDraw par DmitriySalnikov, Simple Skybox par Chaosus.

# END_GAME_ADDITIONAL_CREDITS
source: Additionnal credits : Speedlines by Exuin (godotshaders.com), Screen shakes (codingkaiju.com), Quake 3 movement Godot (rhulha)
french: Crédits additionnels : Speedlines par Exuin (godotshaders.com), Screen shakes (codingkaiju.com)

# END_GAME_FAMILY_AND_FRIENDS
source: Thanks to my family and friends (Hi GCC and %s)
french: Avec un grand merci à ma famille et mes amis

# END_GAME_AND_YOU
source: [center][rainbow freq=0.2 sat=10 val=20][wave amp=50 freq=2]And you for playing the game ![/wave][/rainbow][/center]
french: [center][rainbow freq=0.2 sat=10 val=20][wave amp=50 freq=2]Et vous pour avoir joué au jeu ![/wave][/rainbow][/center]

# END_GAME_PRETTY_MUCH_IT
source: And, uh, that's pretty much it I think
french: Et, euh, c'est à peu près tout je crois

# END_GAME_CREDITS_TOO_LONG
source: Ok, I admit, I made the music a bit too long for the credits...
french: Ok, j'avoue, j'ai fait la musique un peu trop longue par rapport aux crédits...

# END_GAME_WONT_BE_LONG
source: But that won't be long, I promise !
french: Mais ça sera plus très long, promis !

# END_GAME_ANY_SECOND_NOW
source: Any second now
french: C'est pour bientôt

# END_GAME_ANY_SECOND
source: Aaaaaaaany second
french: Bientôôôôôôôôôt

# END_GAME_THERE_WE_GO
source: Oh, there we go !
french: Ah, ça y est !

# END_GAME_RESTARTING_SIMULATION
source: Restarting the simulation
french: Redémarrage de la simulation
